#Add Halo
addHaloToBlock {10 10 10 10} -allMacro
addHaloToBlock {10 10 10 10} -allMacro

#Cut rows 
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[0].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[0].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[0].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[0].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[1].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[1].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[1].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[1].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[2].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[2].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[2].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[2].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[2].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[2].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[2].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[2].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[1].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[1].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[1].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[1].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[0].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[0].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[0].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[0].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[3].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[3].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[3].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[3].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[3].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[3].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[3].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[3].ram_blocks[0].sp_ram_i}
cutRow -selected
cutRow -selected

#Global net connect
clearGlobalNets
globalNetConnect VDD -type tiehi -inst *
globalNetConnect VDD -type pgpin -pin vdd -inst *
globalNetConnect GND -type pgpin -pin gnd -inst *
globalNetConnect GND -type tielo -inst *
globalNetConnect GND -type pgpin -pin GNDC -inst *
globalNetConnect VDD -type pgpin -pin VDDC -inst *
set sprCreateIeRingNets {}
set sprCreateIeRingLayers {}
set sprCreateIeRingWidth 1.0
set sprCreateIeRingSpacing 1.0
set sprCreateIeRingOffset 1.0
set sprCreateIeRingThreshold 1.0
set sprCreateIeRingJogDistance 1.0

#Power rings around core
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -type core_rings -jog_distance 2.5 -threshold 2.5 -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2
editPushUndo
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -type core_rings -jog_distance 2.5 -threshold 2.5 -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2

#Power rings around macros (selected one by one)
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[0].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[0].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[0].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[0].ram_blocks[3].sp_ram_i}
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -around selected -jog_distance 0.4 -threshold 0.4 -type block_rings -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2 -skip_side {left top}
editPushUndo
deselectAll
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[1].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[1].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[1].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[1].ram_blocks[3].sp_ram_i}
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -around selected -jog_distance 0.4 -threshold 0.4 -type block_rings -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2 -skip_side top
editPushUndo
deselectAll
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[2].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[2].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[2].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[2].ram_blocks[3].sp_ram_i}
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -around selected -jog_distance 0.4 -threshold 0.4 -type block_rings -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2 -skip_side {top right}
editPushUndo
deselectAll
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[3].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[3].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[3].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/data_mem/bank_loop[3].ram_blocks[3].sp_ram_i}
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -around selected -jog_distance 0.4 -threshold 0.4 -type block_rings -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2 -skip_side right
editPushUndo
deselectAll
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[0].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[0].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[0].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[0].ram_blocks[3].sp_ram_i}
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -around selected -jog_distance 0.4 -threshold 0.4 -type block_rings -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2 -skip_side {bottom right}
editPushUndo
deselectAll
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[1].ram_blocks[0].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[1].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[1].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[1].ram_blocks[3].sp_ram_i}
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -around selected -jog_distance 0.4 -threshold 0.4 -type block_rings -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2 -skip_side bottom
editPushUndo
deselectAll
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[2].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[2].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[2].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[2].ram_blocks[0].sp_ram_i}
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -around selected -jog_distance 0.4 -threshold 0.4 -type block_rings -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2 -skip_side {left bottom}
editPushUndo
deselectAll
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[3].ram_blocks[3].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[3].ram_blocks[2].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[3].ram_blocks[1].sp_ram_i}
selectInst {pulpino_inst_core_region_i/instr_mem/sp_ram_wrap_i_bank_loop[3].ram_blocks[0].sp_ram_i}
addRing -skip_via_on_wire_shape Noshape -skip_via_on_pin Standardcell -stacked_via_top_layer AP -around selected -jog_distance 0.4 -threshold 0.4 -type block_rings -nets {GND VDD} -follow core -stacked_via_bottom_layer M1 -layer {bottom M3 top M3 right M4 left M4} -width 2 -spacing 2 -offset 2 -skip_side left
editPushUndo

#Add stripes
set sprCreateIeStripeNets {}
set sprCreateIeStripeLayers {}
set sprCreateIeStripeWidth 10.0
set sprCreateIeStripeSpacing 2.0
set sprCreateIeStripeThreshold 1.0
addStripe -skip_via_on_wire_shape Noshape -block_ring_top_layer_limit M1 -max_same_layer_jog_length 6 -padcore_ring_bottom_layer_limit M1 -set_to_set_distance 100 -skip_via_on_pin Standardcell -stacked_via_top_layer AP -padcore_ring_top_layer_limit M1 -spacing 2 -merge_stripes_value 2.5 -direction horizontal -layer M3 -block_ring_bottom_layer_limit M1 -stop_x 0 -stop_y 0 -width 2 -area {} -nets {GND VDD} -start_x 0 -stacked_via_bottom_layer M1 -start_y 0
editPushUndo
addStripe -skip_via_on_wire_shape Noshape -block_ring_top_layer_limit M1 -max_same_layer_jog_length 6 -padcore_ring_bottom_layer_limit M1 -set_to_set_distance 100 -skip_via_on_pin Standardcell -stacked_via_top_layer AP -padcore_ring_top_layer_limit M1 -spacing 2 -merge_stripes_value 2.5 -direction horizontal -layer M3 -block_ring_bottom_layer_limit M1 -stop_x 0 -stop_y 0 -width 2 -area {} -nets {GND VDD} -start_x 0 -stacked_via_bottom_layer M1 -start_y 0
addStripe -skip_via_on_wire_shape Noshape -block_ring_top_layer_limit M1 -max_same_layer_jog_length 6 -padcore_ring_bottom_layer_limit M1 -set_to_set_distance 100 -skip_via_on_pin Standardcell -stacked_via_top_layer AP -padcore_ring_top_layer_limit M1 -spacing 2 -merge_stripes_value 2.5 -layer M4 -block_ring_bottom_layer_limit M1 -stop_x 0 -stop_y 0 -width 2 -area {} -nets {GND VDD} -start_x 0 -stacked_via_bottom_layer M1 -start_y 0
editPushUndo
addStripe -skip_via_on_wire_shape Noshape -block_ring_top_layer_limit M1 -max_same_layer_jog_length 6 -padcore_ring_bottom_layer_limit M1 -set_to_set_distance 100 -skip_via_on_pin Standardcell -stacked_via_top_layer AP -padcore_ring_top_layer_limit M1 -spacing 2 -merge_stripes_value 2.5 -layer M4 -block_ring_bottom_layer_limit M1 -stop_x 0 -stop_y 0 -width 2 -area {} -nets {GND VDD} -start_x 0 -stacked_via_bottom_layer M1 -start_y 0

#Place well taps
addWellTap -cell HS65_LS_FILLERSNPWPFP4 -cellInterval 25 -prefix WELLTAP

#Placing standard cells pre-cts optimiztions
setPlaceMode -prerouteAsObs {1 2 3 4 5 6 7 8}
setPlaceMode -place_global_uniform_density true
setPlaceMode -fp false
placeDesign
setDrawView place

#Pre-cts optimiztions
timeDesign -preCTS -drvReports
setOptMode -fixCap false -fixTran false -fixFanoutLoad false
optDesign -preCTS -incr
setOptMode -fixCap true -fixTran true -fixFanoutLoad true
optDesign -preCTS

suspend

#Clock tree synt
set_ccopt_property inverter_cells { HS65_LL_CNIVX10 HS65_LL_CNIVX103 HS65_LL_CNIVX124
HS65_LL_CNIVX14 HS65_LL_CNIVX17 HS65_LL_CNIVX21 HS65_LL_CNIVX24
HS65_LL_CNIVX27 HS65_LL_CNIVX3 HS65_LL_CNIVX31 HS65_LL_CNIVX34 HS65_LL_CNIVX38
HS65_LL_CNIVX41 HS65_LL_CNIVX45 HS65_LL_CNIVX48 HS65_LL_CNIVX52 HS65_LL_CNIVX55
HS65_LL_CNIVX58 HS65_LL_CNIVX62 HS65_LL_CNIVX7 HS65_LL_CNIVX82}
set_ccopt_property buffer_cells {HS65_LL_CNBFX10 HS65_LL_CNBFX103 HS65_LL_CNBFX124
HS65_LL_CNBFX14 HS65_LL_CNBFX17 HS65_LL_CNBFX21 HS65_LL_CNBFX24
HS65_LL_CNBFX27 HS65_LL_CNBFX31 HS65_LL_CNBFX34 HS65_LL_CNBFX38
HS65_LL_CNBFX38_0 HS65_LL_CNBFX38_1 HS65_LL_CNBFX38_10 HS65_LL_CNBFX38_11
HS65_LL_CNBFX38_12 HS65_LL_CNBFX38_13 HS65_LL_CNBFX38_14 HS65_LL_CNBFX38_15
HS65_LL_CNBFX38_16 HS65_LL_CNBFX38_17 HS65_LL_CNBFX38_18
HS65_LL_CNBFX38_19 HS65_LL_CNBFX38_2 HS65_LL_CNBFX38_20 HS65_LL_CNBFX38_21
HS65_LL_CNBFX38_22 HS65_LL_CNBFX38_23 HS65_LL_CNBFX38_3 HS65_LL_CNBFX38_4
HS65_LL_CNBFX38_5 HS65_LL_CNBFX38_6 HS65_LL_CNBFX38_7 HS65_LL_CNBFX38_8
HS65_LL_CNBFX38_9 HS65_LL_CNBFX41 HS65_LL_CNBFX45 HS65_LL_CNBFX48
HS65_LL_CNBFX52 HS65_LL_CNBFX55 HS65_LL_CNBFX58 HS65_LL_CNBFX62 HS65_LL_CNBFX82 }
set hold_fixing_cells { HS65_LL_DLYIC2X7 HS65_LL_DLYIC2X9 HS65_LL_DLYIC4X4 HS65_LL_DLYIC4X7 HS65_LL_DLYIC4X9 HS65_LL_DLYIC6X4 HS65_LL_DLYIC6X7 HS65_LL_DLYIC6X9 }
create_ccopt_clock_tree_spec -file ./ccopt.spec
source ./ccopt.spec
ccopt_design

#setOptMode -holdFixingCells { HS65_LL_DLYIC2X7 HS65_LL_DLYIC2X9 HS65_LL_DLYIC4X4 HS65_LL_DLYIC4X7 HS65_LL_DLYIC4X9 HS65_LL_DLYIC6X4 HS65_LL_DLYIC6X7 HS65_LL_DLYIC6X9 } 
setOptMode -holdFixingCells {HS65_LL_BFX106 HS65_LL_BFX13 HS65_LL_BFX142 HS65_LL_BFX18 HS65_LL_BFX2 HS65_LL_BFX213 HS65_LL_BFX22 HS65_LL_BFX27 HS65_LL_BFX284 HS65_LL_BFX31 HS65_LL_BFX35 HS65_LL_BFX4 HS65_LL_BFX40 HS65_LL_BFX44 HS65_LL_BFX49 HS65_LL_BFX53 HS65_LL_BFX62 HS65_LL_BFX7 HS65_LL_BFX71 HS65_LL_BFX9 HS65_LL_BFX106 HS65_LL_BFX13 HS65_LL_BFX142 HS65_LL_BFX18 HS65_LL_BFX2 HS65_LL_BFX213 HS65_LL_BFX22 HS65_LL_BFX27 HS65_LL_BFX284 HS65_LL_BFX31 HS65_LL_BFX35 HS65_LL_BFX4 HS65_LL_BFX40 HS65_LL_BFX44 HS65_LL_BFX49 HS65_LL_BFX53 HS65_LL_BFX62 HS65_LL_BFX7 HS65_LL_BFX71 HS65_LL_BFX9 HS65_LL_BFX106 HS65_LL_BFX13 HS65_LL_BFX142 HS65_LL_BFX18 HS65_LL_BFX2 HS65_LL_BFX213 HS65_LL_BFX22 HS65_LL_BFX27 HS65_LL_BFX284 HS65_LL_BFX31 HS65_LL_BFX35 HS65_LL_BFX4 HS65_LL_BFX40 HS65_LL_BFX44 HS65_LL_BFX49 HS65_LL_BFX53 HS65_LL_BFX62 HS65_LL_BFX7 HS65_LL_BFX71 HS65_LL_BFX9 HS65_LL_BFX106 HS65_LL_BFX13 HS65_LL_BFX142 HS65_LL_BFX18 HS65_LL_BFX2 HS65_LL_BFX213 HS65_LL_BFX22 HS65_LL_BFX27 HS65_LL_BFX284 HS65_LL_BFX31 HS65_LL_BFX35 HS65_LL_BFX4 HS65_LL_BFX40 HS65_LL_BFX44 HS65_LL_BFX49 HS65_LL_BFX53 HS65_LL_BFX62 HS65_LL_BFX7 HS65_LL_BFX71 HS65_LL_BFX9}

#Clock tree reports
report_ccopt_clock_trees -filename ./clktree_ccopt.rpt
report_ccopt_skew_groups -filename ./skewgrp_ccopt.rpt
report_ccopt_worst_chain -filename ./worstChain_ccopt.rpt

#Add I/O filler cells
addIoFiller -cell PADSPACE_74x1u -prefix IO_FILLER -side n
fit
addIoFiller -cell PADSPACE_74x1u -prefix IO_FILLER -side s
fit
addIoFiller -cell PADSPACE_74x1u -prefix IO_FILLER -side w
fit
addIoFiller -cell PADSPACE_74x1u -prefix IO_FILLER -side e
fit
